TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_fir_filter_fpu64_f2838x.c
#include "c2000ware_libraries.h"
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "fpu.h"
#include "dsp.h"
#include "dsp_examples_setup.h"

float64_t test_input[571] = {
    12.182432736101L, 13.240272807741L, 13.453528790544L,  6.573832585863L,
     2.065944310244L, -3.063989115918L, -1.505559123697L, -4.363534124143L,
    -6.525775279257L, -10.770371179678L, -6.657080950415L, -3.726277929507L,
     1.091358896956L,  1.313620536676L,  5.132521783988L,  3.515709557738L,
     2.066037941988L, -2.568439952978L,  0.044431011188L,  0.839749550329L,
     2.855287410502L, -0.431673695035L,  0.572296629610L, -0.896732227726L,
     0.944776597034L, -0.566752375496L,  1.322428960835L, -1.908269650340L,
    -2.451636667667L, -3.308668666527L,  2.870431280321L,  3.725541388238L,
     2.882151601939L, -2.312965748825L,  0.073743084414L,  1.239998776150L,
     3.350860256692L, -0.751235872216L, -1.218821513653L, -4.046309496695L,
    -2.555979728358L, -2.621930243923L,  2.424951789767L,  2.216224200204L,
     1.723218556421L, -3.077148464034L, -2.050489500574L, -2.926058784889L,
    -0.354012046871L, -0.464124967208L,  3.458486346717L,  1.501751320625L,
     0.311218364641L, -2.205012874001L,  3.479956113025L,  5.648258140663L,
     5.921800134327L, -0.641256338518L, -1.654920910321L, -2.947006852288L,
    -0.188721488219L, -1.546574852857L,  0.032721562675L, -2.868144503431L,
    -2.614356649506L, -3.619381641413L,  0.978432005562L,  0.355279191803L,
    -0.084046849056L, -3.350693450718L,  0.345337880913L,  1.060216280119L,
     2.354424404606L, -0.835268649808L,  1.307168451852L,  0.554992698587L,
     1.906417241764L,  0.299233889655L,  4.387996887693L,  4.343317377888L,
     3.845680264730L, -2.112572584997L, -2.602862785186L, -4.047448898986L,
    -1.343898243250L, -2.157510068880L, -0.210616237204L, -3.645918379809L,
    -3.846279018968L, -3.377577129017L,  4.649446965053L,  6.733924838455L,
     5.504692728527L, -1.729495633384L, -1.951880040840L, -2.420106901083L,
     0.001672198749L, -2.113503374817L, -0.233392914004L, -1.788634476730L,
    -0.666007063128L, -2.082150033777L,  1.981063568159L,  2.188288520727L,
     3.483716820893L,  0.803264720708L,  2.995533091555L,  1.695557095174L,
     2.622400900748L,  0.603237054689L,  3.075516784295L,  0.060830435484L,
    -2.485995862002L, -7.213613097450L, -4.278834317872L, -4.122177509628L,
    -3.601639901502L, -6.956842000833L, -2.561821879348L,  1.802572298645L,
     8.364327067956L,  7.845490415669L,  7.663500983988L,  1.801994753839L,
    -0.656397744560L, -3.445137434240L,  0.105997531046L, -1.319410743995L,
    -2.415799408127L, -5.694757947382L, -0.740583918518L,  2.492406134364L,
     6.530133645783L,  4.651076119504L,  5.394092107805L,  0.568167327090L,
    -3.305922370962L, -9.046762480035L, -6.268350083014L, -4.480923436228L,
    -1.101412391074L, -2.825847550702L,  0.024978761741L,  0.739358875621L,
     4.819870607647L,  4.959483305457L,  7.218170111986L,  2.784922720456L,
    -0.154181606936L, -3.687865149460L,  0.506954101782L,  0.599877655846L,
     0.092755565262L, -4.243067200291L, -1.059566592812L,  0.601441541511L,
     3.044510317643L, -0.638831960992L, -0.564111279917L, -2.996566129363L,
    -1.620117605450L, -2.405136669363L,  1.682174145161L,  0.943512885856L,
     0.894506652461L, -2.479528541232L,  0.343185088606L,  0.723225024258L,
     3.330080262822L,  1.964948601989L,  3.875558499358L, -0.084098965335L,
    -2.719880366884L, -6.012073779017L, -0.627632783091L,  1.546898029384L,
     2.224255839920L, -3.253371799140L, -2.341960156218L, -1.145097264522L,
     3.935322014392L,  3.880662559954L,  5.255022574792L,  0.816999882220L,
    -1.056044142127L, -3.907524451814L, -0.359830459547L, -1.278070034887L,
    -1.668328069864L, -4.915235376063L, -1.259304521989L, -0.354755235459L,
     1.652038021931L, -0.351236787977L,  2.973739883947L,  2.756072579516L,
     3.612982749854L,  0.644718631464L,  3.129502709806L,  1.930792296626L,
     1.070536765847L, -4.617765848948L, -4.647176686222L, -5.760759222816L,
    -2.784179795891L, -2.991926710524L,  0.237413805714L, -1.317787809070L,
     0.372261541840L,  1.939532432107L,  9.737503989064L, 10.330059811625L,
     6.966242334730L, -2.254764137440L, -3.803104955421L, -4.902246504247L,
    -2.704600379360L, -4.892890412697L, -2.905384131460L, -3.913542911762L,
    -1.630390044913L, -1.492376080164L,  3.881081957792L,  4.426999340283L,
     4.745877003466L,  0.099076744642L,  0.206957641136L, -2.345904829770L,
    -1.323208913146L, -2.035021539751L,  2.351223834399L,  1.214390525485L,
     0.180380221588L, -3.375889378157L,  0.511164349854L,  1.323689631883L,
     1.856433832759L, -2.508377961998L, -0.184787514815L,  1.539971284443L,
     5.751388081034L,  3.935246656747L,  3.735136951550L, -1.296556686072L,
    -2.871241229693L, -5.369135721799L, -2.240513835791L, -4.393108736349L,
    -5.927843990226L, -8.997811222349L, -3.252521700125L,  1.020878521108L,
     6.092345075951L,  5.296900140960L,  7.466171687813L,  4.601559883807L,
     2.988745659322L, -0.890171344402L,  2.513303694754L,  3.200357353731L,
     3.928648209739L, -1.240838128493L, -1.710706695104L, -3.582913077167L,
    -1.255575826642L, -2.271402433083L, -0.758985055869L, -5.398699998214L,
    -7.612943051518L, -9.184140594764L, -1.930173390920L,  1.646011934664L,
     4.126275091000L,  1.583338656138L,  5.218287906312L,  6.363583443478L,
     7.870817881385L,  3.157432631825L,  2.067852333779L, -1.871499937314L,
    -2.357961368070L, -4.962068430859L, -1.967298745938L, -2.521171687757L,
    -1.096790033664L, -2.332090226033L,  2.345228445044L,  3.536372967907L,
     5.723888918939L,  3.100674088916L,  3.543780698043L, -1.644787242236L,
    -5.197823236962L, -9.254548545341L, -4.549322799205L, -2.734093765877L,
    -1.659332615421L, -5.696257313185L, -2.495836592187L,  1.132312478619L,
     7.909682537951L,  8.271946999379L,  8.889635025751L,  3.194340556425L,
     0.366058468239L, -2.695653404267L,  1.255423458958L,  0.829787795439L,
     0.518178215392L, -3.215728525659L, -0.396497619760L, -0.368295853645L,
     0.813127122998L, -2.173270782194L, -0.263965848995L, -2.305510590825L,
    -3.165731877615L, -6.913782376330L, -3.588875879907L, -2.241632937655L,
     0.518956874542L, -1.519448285801L,  1.196940751232L,  1.511777955459L,
     4.745640708881L,  4.025973322986L,  6.249455852196L,  3.181239869060L,
     2.714988827497L,  1.555816237639L,  6.540477415348L,  4.996226831663L,
     0.813753755137L, -7.781417463899L, -7.741426267831L, -7.090077211040L,
    -3.620085217626L, -5.159308547558L, -2.829069801622L, -3.376446949171L,
    -0.377928365322L,  0.446055337163L,  5.999729365681L,  5.960923935051L,
     5.158673555180L, -0.516657920513L, -0.711187209011L, -2.624930215879L,
    -0.368452685651L,  0.074871880811L,  4.977775884303L,  3.597191681801L,
     1.860508542087L, -2.448433004094L,  0.799110431789L,  0.897513156468L,
     0.330875737347L, -5.573339561528L, -4.810905210436L, -3.924063431342L,
     0.803939776413L,  0.940473294573L,  3.541909702535L,  1.198628064911L,
     1.377213219514L, -0.591308601595L,  2.113750617501L, -0.901303104275L,
    -3.376545304512L, -7.435195664914L, -2.879044530346L, -0.010845330088L,
     3.757614743871L,  2.295741022431L,  4.815488763043L,  3.199867109325L,
     3.082095140431L,  0.100279317964L,  3.277276004038L,  2.739356365440L,
     1.944055595752L, -4.205737779152L, -4.621686553238L, -5.492104210330L,
    -1.714618794801L, -1.348820278972L,  1.258368427749L, -2.482341940240L,
    -3.859348397942L, -4.771766683400L,  2.545576428188L,  5.141380627253L,
     5.516748718027L,  0.247524366011L,  1.456775126914L,  1.346066809233L,
     3.109011449240L, -0.181269915851L,  0.545524544344L, -1.903758219124L,
    -1.517053038778L, -3.702809025661L, -0.429817221796L, -0.738334001751L,
     0.672530877689L, -1.186957847738L,  2.149112107129L,  1.649950289526L,
     2.522205495193L, -0.369211609111L,  1.056933225833L, -2.286103255334L,
    -3.856713164564L, -6.405502586227L, -0.842700806382L,  1.409690137475L,
     2.802640652065L, -1.024479617595L,  1.902550409930L,  4.276424599931L,
     8.629809559504L,  5.792887306921L,  3.310138896409L, -4.464531040943L,
    -7.850632626951L, -10.065108804795L, -4.403989789401L, -2.814149226111L,
    -1.060890787932L, -2.634477100142L,  2.508672225430L,  4.811670836195L,
     7.675552136494L,  5.184727798955L,  6.173725134626L,  2.169062506224L,
    -0.869663096305L, -6.190574283496L, -3.488258156924L, -2.104946417135L,
     0.676664037928L, -1.929483053367L, -0.471550680877L, -1.718701492428L,
     0.211129775482L, -1.205811918329L,  0.898008005774L, -1.958551738935L,
    -2.017433021425L, -2.395711506891L,  4.120216178002L,  5.066991167932L,
     4.039300799539L, -1.562380840472L,  0.315143330742L,  1.013980889306L,
     2.820348740855L, -1.362451831982L, -1.699551907454L, -4.257082710703L,
    -2.453214611890L, -2.241279827617L,  3.015070653723L,  2.967345971618L,
     2.639030030392L, -1.948052080066L, -0.663825069085L, -1.316442382367L,
     1.296321700717L,  0.869424843815L,  3.981692929012L,  0.695939919504L,
    -2.206039627713L, -6.512216205311L, -2.272836474829L, -0.761803641408L,
    -0.015951176363L, -4.853854078910L, -3.054841270921L, -0.899842238654L,
     5.279219068283L,  6.592487258029L,  9.482310962926L,  6.191980523472L,
     4.387202588368L,  0.063962939982L,  0.783393868458L, -3.453955840921L,
    -6.493930201728L, -10.855443389189L, -6.629335587871L, -4.032209069599L,
    -0.085554914910L, -0.582685646687L,  3.609244190637L,  3.802956760267L,
     4.868353848001L,  1.962834850818L,  4.229227046919L,  2.446118712575L,
     0.846774841055L, -5.230300572994L, -4.803986095028L, -4.539011178953L,
     0.209986379795L,  1.241618970093L,  4.368342858277L,  1.174626945516L,
     0.258066766929L, -0.726203771512L,  5.495056254207L,  5.852205047507L,
     0.000359976670L, -0.000434091233L, -0.000941633220L, -0.001662963303L,
    -0.002401690879L, -0.002895125406L, -0.002849792236L, -0.002018453018L,
    -0.000295152412L,  0.002199321830L,  0.005070891835L,  0.007672335634L,
     0.009204313082L,  0.008887369916L,  0.006181062702L,  0.000998827742L,
    -0.006135795740L, -0.014043791726L, -0.020990186600L, -0.024933498021L,
    -0.023892270448L, -0.016363317305L, -0.001706184865L,  0.019595921893L,
     0.045863956323L,  0.074386051109L,  0.101782198366L,  0.124539463534L,
     0.139593998881L,  0.144858856161L,  0.139593998881L,  0.124539463534L,
     0.101782198366L,  0.074386051109L,  0.045863956323L,  0.019595921893L,
    -0.001706184865L, -0.016363317305L, -0.023892270448L, -0.024933498021L,
    -0.020990186600L, -0.014043791726L, -0.006135795740L,  0.000998827742L,
     0.006181062702L,  0.008887369916L,  0.009204313082L,  0.007672335634L,
     0.005070891835L,  0.002199321830L, -0.000295152412L, -0.002018453018L,
    -0.002849792236L, -0.002895125406L, -0.002401690879L, -0.001662963303L,
    -0.000941633220L, -0.000434091233L,  0.000359976670L, };

const float64_t test_golden[512] = {
     0.004385391575L, -0.000522097922L, -0.012375913210L, -0.036200051835L,
    -0.066054766368L, -0.097631349697L, -0.117450189298L, -0.118527317646L,
    -0.086596103258L, -0.016058356464L,  0.095934828082L,  0.230198695980L,
     0.360754927412L,  0.446953102835L,  0.452441454072L,  0.340444862903L,
     0.101337272264L, -0.248874315618L, -0.652628187821L, -1.029567817967L,
    -1.272228550205L, -1.275343784477L, -0.946597189263L, -0.245528963627L,
     0.812552703699L,  2.136317027526L,  3.576256079918L,  4.930340057908L,
     5.990402655523L,  6.565689566671L,  6.528787024835L,  5.828623137762L,
     4.521349505703L,  2.755329734530L,  0.759517811455L, -1.209287640490L,
    -2.894027553662L, -4.089310095872L, -4.661644662925L, -4.583206799451L,
    -3.918212566269L, -2.818789614710L, -1.483452242228L, -0.134882909346L,
     1.032442761837L,  1.870332519593L,  2.306436549714L,  2.333309786058L,
     2.014760452924L,  1.454982066788L,  0.786181830107L,  0.130152318811L,
    -0.405636104153L, -0.753759564596L, -0.882580505687L, -0.810098049426L,
    -0.578929135944L, -0.254219658386L,  0.108314363465L,  0.432896036510L,
     0.679416687521L,  0.812343427015L,  0.829296519983L,  0.730982406015L,
     0.543227414922L,  0.285057124576L, -0.008224981018L, -0.314850418133L,
    -0.602247551683L, -0.856100885660L, -1.053701603170L, -1.189108996307L,
    -1.244090659606L, -1.214540989990L, -1.084798140895L, -0.856978530667L,
    -0.527282735646L, -0.116553708082L,  0.354418554823L,  0.838756703144L,
     1.294320830413L,  1.662480446371L,  1.901737166542L,  1.967985864959L,
     1.848348146803L,  1.539298078122L,  1.075247185288L,  0.498479476010L,
    -0.121847796398L, -0.727248222303L, -1.252651856783L, -1.659906492385L,
    -1.914334453622L, -2.012646148512L, -1.953918429976L, -1.761450728260L,
    -1.449842782896L, -1.047931323629L, -0.570891762839L, -0.048550276216L,
     0.499013388989L,  1.031860945384L,  1.515830065638L,  1.897013792268L,
     2.133463984008L,  2.176077757562L,  2.005394971670L,  1.614131140079L,
     1.039972353986L,  0.338489957552L, -0.396462996472L, -1.071996892670L,
    -1.585902102461L, -1.871504181116L, -1.885130944080L, -1.640326188345L,
    -1.180376641199L, -0.597932673191L,  0.005520210611L,  0.511736068024L,
     0.834118084825L,  0.909724279450L,  0.738026150047L,  0.355967064545L,
    -0.143129896809L, -0.652559723762L, -1.045958653072L, -1.226298333761L,
    -1.119517435470L, -0.717082714738L, -0.055697230575L,  0.760268838314L,
     1.600540771670L,  2.304480364589L,  2.735204884027L,  2.780351188546L,
     2.401470655346L,  1.618879319746L,  0.537299736395L, -0.695103065027L,
    -1.884581528634L, -2.850869801371L, -3.433961726162L, -3.549480707066L,
    -3.178814385816L, -2.398073059196L, -1.337375050308L, -0.181078264199L,
     0.893173200810L,  1.722184126787L,  2.213059291212L,  2.333015207543L,
     2.136049471568L,  1.718465066240L,  1.216720423311L,  0.748263431164L,
     0.410436896167L,  0.234881743924L,  0.209061883261L,  0.258706641589L,
     0.296730730567L,  0.225062930522L, -0.010242057577L, -0.425743916372L,
    -0.967052337987L, -1.544725323774L, -2.029310292045L, -2.307578970080L,
    -2.285034793709L, -1.935178899558L, -1.281976260196L, -0.421467724077L,
     0.522763483775L,  1.397932312129L,  2.077253550719L,  2.458716877420L,
     2.508884760689L,  2.239490385442L,  1.724930037084L,  1.057141614650L,
     0.350984181763L, -0.302981569257L, -0.826614762950L, -1.188408689022L,
    -1.375471982312L, -1.412579487849L, -1.323610214777L, -1.147399429689L,
    -0.904024878281L, -0.620486043242L, -0.306244047131L,  0.015913304121L,
     0.332809711807L,  0.611155427817L,  0.825068985087L,  0.934282174339L,
     0.919489303989L,  0.764177847713L,  0.488266128400L,  0.123806276546L,
    -0.261383963968L, -0.600749019274L, -0.817037962939L, -0.865189633914L,
    -0.718124114695L, -0.400200161550L,  0.040898754135L,  0.515653250540L,
     0.933698663249L,  1.194746290185L,  1.235126598072L,  1.018241289125L,
     0.571407185344L, -0.042170657216L, -0.707946507856L, -1.305872780561L,
    -1.706648875638L, -1.822888258711L, -1.602833501287L, -1.069543333387L,
    -0.294747428484L,  0.585321569670L,  1.418425115455L,  2.037987974450L,
     2.320591826493L,  2.185705244399L,  1.640238187170L,  0.756007678611L,
    -0.314248199298L, -1.388760443561L, -2.263797812540L, -2.777250503282L,
    -2.814577987218L, -2.358541732708L, -1.469194219487L, -0.299613951724L,
     0.957565892397L,  2.079001009457L,  2.876347615144L,  3.204943309562L,
     3.016611590597L,  2.342827490270L,  1.313342501760L,  0.104310011726L,
    -1.070578668007L, -2.025709653672L, -2.610066494199L, -2.756808672671L,
    -2.465543134007L, -1.824351032694L, -0.964463228444L, -0.058815085870L,
     0.736951699656L,  1.286531467967L,  1.521170617904L,  1.423415713204L,
     1.052425479553L,  0.503490803299L, -0.086813290621L, -0.592454931630L,
    -0.894704425994L, -0.928663558336L, -0.669132867585L, -0.161390484348L,
     0.511746648147L,  1.217928448914L,  1.823760177277L,  2.192173436879L,
     2.232104546474L,  1.889320503588L,  1.184087894434L,  0.185821965538L,
    -0.969372739135L, -2.125363508550L, -3.104714376427L, -3.761787058137L,
    -3.978631200513L, -3.709075928378L, -2.960697551123L, -1.820289584811L,
    -0.415023516909L,  1.080462200421L,  2.495026977891L,  3.657923612676L,
     4.445370427127L,  4.766554613787L,  4.596572327158L,  3.949393681501L,
     2.899773481227L,  1.547844412710L,  0.035847323058L, -1.490281800181L,
    -2.867327287173L, -3.956863138794L, -4.633337571361L, -4.824213564278L,
    -4.494058505732L, -3.679832078208L, -2.466837533223L, -1.009463983189L,
     0.512633708640L,  1.893403303252L,  2.958034297048L,  3.566172805800L,
     3.662622236944L,  3.262675076337L,  2.476680845699L,  1.465065291428L,
     0.433557446252L, -0.433177402945L, -0.982698841028L, -1.150045734950L,
    -0.943936884006L, -0.469264688606L,  0.121959289992L,  0.639727386654L,
     0.924940405659L,  0.860362977534L,  0.423187585550L, -0.333742290506L,
    -1.266285270551L, -2.194765903508L, -2.916785158262L, -3.275415306402L,
    -3.165762619669L, -2.580941876698L, -1.586499376205L, -0.331984528700L,
     1.003921275027L,  2.221238493643L,  3.160934662336L,  3.706467498200L,
     3.825496409646L,  3.541042821924L,  2.942781459207L,  2.136846220386L,
     1.247814369491L,  0.369792119344L, -0.421399110202L, -1.099879226062L,
    -1.657450050907L, -2.117943388151L, -2.494372065198L, -2.801076686232L,
    -3.017275366179L, -3.112551598697L, -3.026896046580L, -2.711598654186L,
    -2.120257418454L, -1.253198519093L, -0.142407369555L,  1.118589832081L,
     2.408242948951L,  3.565244352828L,  4.437990901629L,  4.884257148651L,
     4.823138870457L,  4.225607105547L,  3.148343886938L,  1.702593271880L,
     0.066305967979L, -1.566869226509L, -2.990585022703L, -4.043209573430L,
    -4.605892943301L, -4.644065744427L, -4.182015126473L, -3.319332234488L,
    -2.185199505940L, -0.942401371646L,  0.263482260832L,  1.298413613226L,
     2.081502096914L,  2.563558599345L,  2.751045273488L,  2.670208346137L,
     2.381818436503L,  1.941482587118L,  1.416590066882L,  0.854292365410L,
     0.307697291968L, -0.190090178825L, -0.598522255180L, -0.897497488938L,
    -1.062831484302L, -1.096463660064L, -1.002450376631L, -0.815427753831L,
    -0.572726212327L, -0.336509248067L, -0.157154822713L, -0.087195068002L,
    -0.142175405032L, -0.320159415855L, -0.573602070918L, -0.841511807612L,
    -1.034306772230L, -1.078307029360L, -0.908460725059L, -0.511735277200L,
     0.091061056447L,  0.819407379792L,  1.570962376630L,  2.213350754876L,
     2.633777162282L,  2.734295207685L,  2.476685053968L,  1.865843667674L,
     0.977055078746L, -0.080912040464L, -1.156857284112L, -2.106888396437L,
    -2.791678025329L, -3.124844575006L, -3.059968809220L, -2.621423996604L,
    -1.872255529570L, -0.929594435341L,  0.078505804765L,  1.006009723918L,
     1.737095750003L,  2.178003156425L,  2.296661376752L,  2.100002925894L,
     1.656143947532L,  1.054855536350L,  0.416663286656L, -0.154486011083L,
    -0.564447401625L, -0.772089366758L, -0.770470068032L, -0.611432004913L,
    -0.366728725489L, -0.136212395984L,  0.001604001300L, -0.015369606988L,
    -0.189985162324L, -0.488094418530L, -0.819633709963L, -1.084500508737L,
    -1.171628988672L, -1.013757190467L, -0.583384442891L,  0.068720188654L,
     0.844014902007L,  1.587882069197L,  2.146670882571L,  2.375651186752L,
     2.197745669670L,  1.598504538630L,  0.660683179124L, -0.472001428519L,
    -1.594370136964L, -2.505848301871L, -3.025838839666L, -3.055649795571L,
    -2.571982996497L, -1.656842547724L, -0.456133900629L,  0.822406193663L,
     1.973768825120L,  2.807083997197L,  3.204219472821L,  3.112060840012L,
     2.573041233939L,  1.686334847035L,  0.611235971177L, -0.489372679961L,
    -1.451628673089L, -2.161481757983L, -2.541650081370L, -2.581579264559L,
    -2.304933042398L, -1.785498754551L, -1.105841095256L, -0.368731149136L,
     0.343151973859L,  0.948885515491L,  1.400333718323L,  1.656776417321L,
     1.712310461003L,  1.568343472450L,  1.258877611279L,  0.820950360146L,
     0.318121819740L, -0.190847131170L, -0.630638440867L, -0.943900410362L,
    -1.074217011599L, -1.003625098798L, -0.733346420228L, -0.312745009813L,
     0.191685415717L,  0.678793600909L,  1.054012408318L,  1.220312527452L,
     1.123463020177L,  0.739893977643L,  0.112130338641L, -0.677917001101L,
    -1.491741154421L, -2.181299671510L, -2.589860481373L, -2.608937250290L,
    -2.177162732637L, -1.323295914728L, -0.141820461136L,  1.192072862441L,
     2.474310342119L,  3.479610607274L,  4.028080289905L,  3.995589143634L,
};

#define TEST_SIZE       (512U)

float64u_t in, out, gold, errld;
uint16_t pass = 0U, fail = 0U;
float64_t tolerance = 1.0e-6;
float64_t *coefficients = &test_input[TEST_SIZE];
float64_t delayLine[myFIR0_FIR_ORDER + 1U];
float64_t test_output[TEST_SIZE];
float64_t *coeffBuff = &test_input[TEST_SIZE];
float64_t *delayBuff = delayLine;
float64_t *inPtr = (float64_t *)&in;
float64_t *outPtr = (float64_t *)&out;

//
// Main
//
void main(void)
{
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
    Board_init();
    C2000Ware_libraries_init();

    //
    // Local variables
    //
    uint16_t i;

    //
    // Run and verify results
    //
    for(i = 0U; i < TEST_SIZE; i++)
    {
        out.f64  = DBL_MAX;
        in.f64   = test_input[i];

        //
        // Call the calculation routine
        //
        myFIR0_handle->calc(myFIR0_handle);

        test_output[i] = out.f64;
        gold.f64 = test_golden[i];

        errld.f64 = fabsf(out.f64 - gold.f64);
        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }
    while(1);
}

//
// End of File
//
